/* С помощью цикла while найдите факториал числа 10 и присвойте его переменной factorial

  Справка:
  Факториал числа 𝑛 (обозначается как 𝑛!)  — это произведение всех натуральных чисел от 1 до 𝑛 включительно.
  Например, факториал числа 3 это 1 * 2 * 3 (6).
*/

// your code
let factorial = 1; // начальное значение для факториала
let n = 10; // число, факториал которого мы ищем
let i = 1; // начальное значение для цикла

while (i <= n) {
  factorial *= i; // умножаем текущее значение факториала на i
  i++; // увеличиваем i на 1
}

console.log(factorial); // выводим результат
