/* Используйте цикл while для нахождения суммы всех нечётных чисел от 1 до 20.
  Результат вычислений сохраните в переменной sum.

  Вам понадобиться оператор остатка от деления %. Например, выражение 5 % 2 вернёт остаток 1.
*/

// your code
let sum = 0; // начальное значение для суммы
let i = 1; // начальное значение для цикла

while (i <= 20) {
  if (i % 2 !== 0) { // проверяем, является ли число нечётным
    sum += i; // добавляем нечётное число к сумме
  }
  i++; // увеличиваем i на 1
}

console.log(sum); // выводим результат
